import csv
import os
from django.db import migrations
from app.models import Tinh, Huyen, Xa
from django.db import models
from django.conf import settings

DATA_HUYEN = [['Thành phố Huế', 'Thành phố', 'Huế', '107.595', '16.4632', '2', '323', '67'], ['Huyện A Lưới', 'Huyện', 'A Lưới', '107.231', '16.2741', '2', '579', '67'], \
['Thị xã Hương Thủy', 'Thị xã', 'Hương Thủy', '107.682', '16.4055', '2', '835', '67'], ['Thị xã Hương Trà', 'Thị xã', 'Hương Trà', '107.477', '16.5227', '2', '1091', '67'], \
['Huyện Nam Đông', 'Huyện', 'Nam Đông', '107.719', '16.1636', '2', '1347', '67'], ['Huyện Phong Điền', 'Huyện', 'Phong Điền', '107.362', '16.5864', '2', '1603', '67'], \
['Huyện Phú Lộc', 'Huyện', 'Phú Lộc', '107.861', '16.2789', '2', '1859', '67'], ['Huyện Phú Vang', 'Huyện', 'Phú Vang', '107.601', '16.5079', '2', '2115', '67'], \
['Huyện Quảng Điền', 'Huyện', 'Quảng Điền', '107.515', '16.5763', '2', '2371', '67']]

DATA_XA = [['Phường An Cựu', 'Phường', 'An Cựu', '107.600543', '16.453118', '3', '65859', '323'], ['Thị trấn A Lưới', 'Thị trấn', 'A Lưới', '107.234075', '16.270662', '3', '66115', '579'], \
['Phường Phú Bài', 'Phường', 'Phú Bài', '107.682425', '16.405172', '3', '66371', '835'], ['Phường Hương An', 'Phường', 'Hương An', '107.519182', '16.46717', '3', '66627', '1091'], \
['Thị trấn Khe Tre', 'Thị trấn', 'Khe Tre', '107.718813', '16.167906', '3', '66883', '1347'], ['Thị trấn Phong Điền', 'Thị trấn', 'Phong Điền', '107.365805', '16.583067', '3', '67139', '1603'], \
['Thị trấn Lăng Cô', 'Thị trấn', 'Lăng Cô', '108.083514', '16.232684', '3', '67395', '1859'], ['Thị trấn Phú Đa', 'Thị trấn', 'Phú Đa', '107.713185', '16.44848', '3', '67651', '2115'], \
['Thị trấn Sịa', 'Thị trấn', 'Sịa', '107.515063', '16.581504', '3', '67907', '2371'], ['Phường An Đông', 'Phường', 'An Đông', '107.604766', '16.460026', '3', '131395', '323'], \
['Phường Thủy Châu', 'Phường', 'Thủy Châu', '107.665081', '16.423523', '3', '131907', '835'], ['Phường Hương Chữ', 'Phường', 'Hương Chữ', '107.519559', '16.489964', '3', '132163', '1091'], \
['Xã Điền Hải', 'Xã', 'Điền Hải', '107.472265', '16.653685', '3', '132675', '1603'], ['Thị trấn Phú Lộc', 'Thị trấn', 'Phú Lộc', '107.880392', '16.270919', '3', '132931', '1859'], \
['Thị trấn Thuận An', 'Thị trấn', 'Thuận An', '107.65098', '16.557117', '3', '133187', '2115'], ['Xã Quảng An', 'Xã', 'Quảng An', '107.54666', '16.547762', '3', '133443', '2371'], \
['Phường An Hòa', 'Phường', 'An Hòa', '107.557373', '16.481668', '3', '196931', '323'], ['Xã A Ngo', 'Xã', 'A Ngo', '107.24146', '16.260426', '3', '197187', '579'], \
['Phường Thủy Dương', 'Phường', 'Thủy Dương', '107.617112', '16.443075', '3', '197443', '835'], ['Phường Hương Hồ', 'Phường', 'Hương Hồ', '107.52278', '16.442345', '3', '197699', '1091'], \
['Xã Điền Hòa', 'Xã', 'Điền Hòa', '107.440114', '16.669869', '3', '198211', '1603'], ['Xã Lộc An', 'Xã', 'Lộc An', '107.770207', '16.324076', '3', '198467', '1859'], \
['Xã Phú An', 'Xã', 'Phú An', '107.635814', '16.508631', '3', '198723', '2115'], ['Xã Quảng Công', 'Xã', 'Quảng Công', '107.549168', '16.609274', '3', '198979', '2371'], \
['Phường An Tây', 'Phường', 'An Tây', '107.59774', '16.4338', '3', '262467', '323'], ['Xã A Roằng', 'Xã', 'A Roằng', '107.398488', '16.113528', '3', '262723', '579'], \
['Phường Thủy Lương', 'Phường', 'Thủy Lương', '107.695054', '16.416838', '3', '262979', '835'], ['Phường Hương Vân', 'Phường', 'Hương Vân', '107.460275', '16.504777', '3', '263235', '1091'], \
['Xã Hương Hữu', 'Xã', 'Hương Hữu', '107.667131', '16.126853', '3', '263491', '1347'], ['Xã Điền Hương', 'Xã', 'Điền Hương', '107.360693', '16.706307', '3', '263747', '1603'], \
['Xã Lộc Bình', 'Xã', 'Lộc Bình', '107.918817', '16.349727', '3', '264003', '1859'], ['Xã Phú Diên', 'Xã', 'Phú Diên', '107.750441', '16.491155', '3', '264259', '2115'], \
['Xã Quảng Lợi', 'Xã', 'Quảng Lợi', '107.464254', '16.614759', '3', '264515', '2371'], ['Phường Phường Đúc', 'Phường', 'Phường Đúc', '107.578135', '16.455687', '3', '328003', '323'], \
['Phường Thủy Phương', 'Phường', 'Thủy Phương', '107.638082', '16.430668', '3', '328515', '835'], ['Phường Hương Văn', 'Phường', 'Hương Văn', '107.483282', '16.519408', '3', '328771', '1091'], \
['Xã Hương Lộc', 'Xã', 'Hương Lộc', '107.72565', '16.161417', '3', '329027', '1347'], ['Xã Điền Lộc', 'Xã', 'Điền Lộc', '107.413181', '16.68447', '3', '329283', '1603'], \
['Xã Lộc Bổn', 'Xã', 'Lộc Bổn', '107.736716', '16.356514', '3', '329539', '1859'], ['Xã Phú Dương', 'Xã', 'Phú Dương', '107.600834', '16.511533', '3', '329795', '2115'], \
['Xã Quảng Ngạn', 'Xã', 'Quảng Ngạn', '107.522665', '16.624891', '3', '330051', '2371'], ['Phường Hương Long', 'Phường', 'Hương Long', '107.547871', '16.456496', '3', '393539', '323'], \
['Xã Đông Sơn', 'Xã', 'Đông Sơn', '107.326816', '16.112583', '3', '393795', '579'], ['Xã Dương Hòa', 'Xã', 'Dương Hòa', '107.623469', '16.327326', '3', '394051', '835'], \
['Phường Hương Xuân', 'Phường', 'Hương Xuân', '107.496185', '16.494346', '3', '394307', '1091'], ['Xã Hương Phú', 'Xã', 'Hương Phú', '107.72498', '16.18892', '3', '394563', '1347'], \
['Xã Điền Môn', 'Xã', 'Điền Môn', '107.391097', '16.693971', '3', '394819', '1603'], ['Xã Lộc Điền', 'Xã', 'Lộc Điền', '107.781057', '16.315272', '3', '395075', '1859'], \
['Xã Phú Hải', 'Xã', 'Phú Hải', '107.701588', '16.524133', '3', '395331', '2115'], ['Xã Quảng Phú', 'Xã', 'Quảng Phú', '107.484627', '16.528791', '3', '395587', '2371'], \
['Phường Hương Sơ', 'Phường', 'Hương Sơ', '107.563237', '16.496624', '3', '459075', '323'], ['Xã Hồng Bắc', 'Xã', 'Hồng Bắc', '107.204715', '16.275856', '3', '459331', '579'], \
['Xã Phú Sơn', 'Xã', 'Phú Sơn', '107.67018', '16.338552', '3', '459587', '835'], ['Phường Tứ Hạ', 'Phường', 'Tứ Hạ', '107.480037', '16.521571', '3', '459843', '1091'], \
['Xã Hương Sơn', 'Xã', 'Hương Sơn', '107.682522', '16.170387', '3', '460099', '1347'], ['Xã Phong An', 'Xã', 'Phong An', '107.452392', '16.544928', '3', '460355', '1603'], \
['Xã Lộc Hòa', 'Xã', 'Lộc Hòa', '107.791665', '16.275767', '3', '460611', '1859'], ['Xã Phú Hồ', 'Xã', 'Phú Hồ', '107.659954', '16.475296', '3', '460867', '2115'], \
['Xã Quảng Phước', 'Xã', 'Quảng Phước', '107.519725', '16.574812', '3', '461123', '2371'], ['Phường Kim Long', 'Phường', 'Kim Long', '107.560415', '16.465119', '3', '524611', '323'], \
['Xã Hồng Hạ', 'Xã', 'Hồng Hạ', '107.358881', '16.290497', '3', '524867', '579'], ['Xã Thủy Bằng', 'Xã', 'Thủy Bằng', '107.579844', '16.394285', '3', '525123', '835'], \
['Xã Thượng Lộ', 'Xã', 'Thượng Lộ', '107.721489', '16.162864', '3', '525635', '1347'], ['Xã Phong Bình', 'Xã', 'Phong Bình', '107.332904', '16.673169', '3', '525891', '1603'], \
['Xã Lộc Sơn', 'Xã', 'Lộc Sơn', '107.73994', '16.34537', '3', '526147', '1859'], ['Xã Phú Lương', 'Xã', 'Phú Lương', '107.706727', '16.456138', '3', '526403', '2115'], \
['Xã Quảng Thái', 'Xã', 'Quảng Thái', '107.431823', '16.629113', '3', '526659', '2371'], ['Phường Phú Bình', 'Phường', 'Phú Bình', '107.577956', '16.493267', '3', '590147', '323'], \
['Xã Hồng Kim', 'Xã', 'Hồng Kim', '107.222177', '16.285896', '3', '590403', '579'], ['Xã Thủy Phù', 'Xã', 'Thủy Phù', '107.719014', '16.375979', '3', '590659', '835'], \
['Xã Bình Thành', 'Xã', 'Bình Thành', '107.535148', '16.363443', '3', '590915', '1091'], ['Xã Thượng Long', 'Xã', 'Thượng Long', '107.652715', '16.114419', '3', '591171', '1347'], \
['Xã Phong Chương', 'Xã', 'Phong Chương', '107.40416', '16.652857', '3', '591427', '1603'], ['Xã Lộc Thủy', 'Xã', 'Lộc Thủy', '107.933581', '16.272772', '3', '591683', '1859'], \
['Xã Phú Mậu', 'Xã', 'Phú Mậu', '107.581527', '16.518176', '3', '591939', '2115'], ['Xã Quảng Thành', 'Xã', 'Quảng Thành', '107.559275', '16.537616', '3', '592195', '2371'], \
['Phường Phú Cát', 'Phường', 'Phú Cát', '107.587424', '16.479482', '3', '655683', '323'], ['Xã Thủy Tân', 'Xã', 'Thủy Tân', '107.719695', '16.403115', '3', '656195', '835'], \
['Xã Hải Dương', 'Xã', 'Hải Dương', '107.582394', '16.590267', '3', '656451', '1091'], ['Xã Thượng Nhật', 'Xã', 'Thượng Nhật', '107.68479', '16.127119', '3', '656707', '1347'], \
['Xã Phong Hải', 'Xã', 'Phong Hải', '107.477065', '16.669475', '3', '656963', '1603'], ['Xã Lộc Tiến', 'Xã', 'Lộc Tiến', '107.989287', '16.271553', '3', '657219', '1859'], \
['Xã Phú Mỹ', 'Xã', 'Phú Mỹ', '107.622326', '16.494179', '3', '657475', '2115'], ['Xã Quảng Thọ', 'Xã', 'Quảng Thọ', '107.525483', '16.542119', '3', '657731', '2371'], \
['Phường Phú Hậu', 'Phường', 'Phú Hậu', '107.588681', '16.491776', '3', '721219', '323'], ['Xã Hồng Thái', 'Xã', 'Hồng Thái', '107.241093', '16.240443', '3', '721475', '579'], \
['Xã Thủy Thanh', 'Xã', 'Thủy Thanh', '107.642172', '16.466222', '3', '721731', '835'], ['Xã Thượng Quảng', 'Xã', 'Thượng Quảng', '107.628971', '16.123811', '3', '722243', '1347'], \
['Xã Phong Hiền', 'Xã', 'Phong Hiền', '107.454504', '16.546223', '3', '722499', '1603'], ['Xã Lộc Trì', 'Xã', 'Lộc Trì', '107.885192', '16.269658', '3', '722755', '1859'], \
['Xã Phú Thanh', 'Xã', 'Phú Thanh', '107.597886', '16.547203', '3', '723011', '2115'], ['Xã Quảng Vinh', 'Xã', 'Quảng Vinh', '107.49673', '16.560319', '3', '723267', '2371'], \
['Phường Phú Hiệp', 'Phường', 'Phú Hiệp', '107.587148', '16.485667', '3', '786755', '323'], ['Xã Hồng Thượng', 'Xã', 'Hồng Thượng', '107.267064', '16.233705', '3', '787011', '579'], \
['Xã Thủy Vân', 'Xã', 'Thủy Vân', '107.604248', '16.478474', '3', '787267', '835'], ['Xã Hương Bình', 'Xã', 'Hương Bình', '107.474623', '16.402825', '3', '787523', '1091'], \
['Xã Hương Xuân', 'Xã', 'Hương Xuân', '107.713956', '16.159968', '3', '787779', '1347'], ['Xã Phong Hòa', 'Xã', 'Phong Hòa', '107.31253', '16.644331', '3', '788035', '1603'], \
['Xã Lộc Vĩnh', 'Xã', 'Lộc Vĩnh', '108.004881', '16.3113', '3', '788291', '1859'], ['Xã Phú Thuận', 'Xã', 'Phú Thuận', '107.68799', '16.537332', '3', '788547', '2115'], \
['Phường Phú Hòa', 'Phường', 'Phú Hòa', '107.586709', '16.475635', '3', '852291', '323'], ['Xã Hồng Thủy', 'Xã', 'Hồng Thủy', '107.074075', '16.397075', '3', '852547', '579'], \
['Xã Hương Phong', 'Xã', 'Hương Phong', '107.591869', '16.563606', '3', '853059', '1091'], ['Xã Phong Mỹ', 'Xã', 'Phong Mỹ', '107.31695', '16.52372', '3', '853571', '1603'], \
['Xã Phú Thượng', 'Xã', 'Phú Thượng', '107.60241', '16.492486', '3', '854083', '2115'], ['Phường Phú Hội', 'Phường', 'Phú Hội', '107.595718', '16.46939', '3', '917827', '323'], \
['Xã Hương Thọ', 'Xã', 'Hương Thọ', '107.561399', '16.374514', '3', '918595', '1091'], ['Xã Phong Sơn', 'Xã', 'Phong Sơn', '107.398144', '16.492591', '3', '919107', '1603'], \
['Xã Phú Xuân', 'Xã', 'Phú Xuân', '107.668253', '16.484452', '3', '919619', '2115'], ['Phường Phú Nhuận', 'Phường', 'Phú Nhuận', '107.593569', '16.461868', '3', '983363', '323'], \
['Xã Hồng Vân', 'Xã', 'Hồng Vân', '107.135986', '16.353938', '3', '983619', '579'], ['Xã Hương Toàn', 'Xã', 'Hương Toàn', '107.53555', '16.516813', '3', '984131', '1091'], \
['Xã Phong Thu', 'Xã', 'Phong Thu', '107.34959', '16.58842', '3', '984643', '1603'], ['Xã Vinh Hiền', 'Xã', 'Vinh Hiền', '107.894385', '16.347198', '3', '984899', '1859'], \
['Xã Vinh An', 'Xã', 'Vinh An', '107.809286', '16.409869', '3', '985155', '2115'], ['Phường Phú Thuận', 'Phường', 'Phú Thuận', '107.560233', '16.474288', '3', '1048899', '323'], \
['Xã Hương Vinh', 'Xã', 'Hương Vinh', '107.571194', '16.512566', '3', '1049667', '1091'], ['Xã Phong Xuân', 'Xã', 'Phong Xuân', '107.358966', '16.50821', '3', '1050179', '1603'], \
['Xã Vinh Hưng', 'Xã', 'Vinh Hưng', '107.842246', '16.374434', '3', '1050435', '1859'], ['Xã Vinh Hà', 'Xã', 'Vinh Hà', '107.809986', '16.373464', '3', '1050691', '2115'], \
['Phường Phước Vĩnh', 'Phường', 'Phước Vĩnh', '107.589062', '16.453351', '3', '1114435', '323'], ['Xã Hương Nguyên', 'Xã', 'Hương Nguyên', '107.387205', '16.305235', '3', '1114691', '579'], \
['Xã Bình Tiến', 'Xã', 'Bình Tiến', '107.446677', '16.351097', '3', '1115203', '1091'], ['Xã Vinh Mỹ', 'Xã', 'Vinh Mỹ', '107.843611', '16.400751', '3', '1115971', '1859'], \
['Phường Tây Lộc', 'Phường', 'Tây Lộc', '107.566204', '16.475851', '3', '1179971', '323'], ['Xã Hương Phong', 'Xã', 'Hương Phong', '107.302078', '16.184987', '3', '1180227', '579'], \
['Xã Xuân Lộc', 'Xã', 'Xuân Lộc', '107.705154', '16.266766', '3', '1181507', '1859'], ['Phường Thuận Hòa', 'Phường', 'Thuận Hòa', '107.573272', '16.466795', '3', '1245507', '323'], \
['Xã Giang Hải', 'Xã', 'Giang Hải', '107.879815', '16.377841', '3', '1247043', '1859'], ['Xã Vinh Thanh', 'Xã', 'Vinh Thanh', '107.78396', '16.434238', '3', '1247299', '2115'], \
['Phường Thuận Lộc', 'Phường', 'Thuận Lộc', '107.571109', '16.482488', '3', '1311043', '323'], ['Xã Phú Vinh', 'Xã', 'Phú Vinh', '107.276125', '16.222889', '3', '1311299', '579'], \
['Xã Vinh Xuân', 'Xã', 'Vinh Xuân', '107.752068', '16.473619', '3', '1312835', '2115'], ['Phường Thuận Thành', 'Phường', 'Thuận Thành', '107.577656', '16.475302', '3', '1376579', '323'], \
['Xã Sơn Thủy', 'Xã', 'Sơn Thủy', '107.25508', '16.24856', '3', '1376835', '579'], ['Xã Phú Gia', 'Xã', 'Phú Gia', '107.768562', '16.422048', '3', '1378371', '2115'], \
['Phường Thủy Biều', 'Phường', 'Thủy Biều', '107.553627', '16.450135', '3', '1442115', '323'], ['Xã Trung Sơn', 'Xã', 'Trung Sơn', '107.170014', '16.331283', '3', '1442371', '579'], \
['Phường Thủy Xuân', 'Phường', 'Thủy Xuân', '107.566916', '16.453264', '3', '1507651', '323'], ['Xã Lâm Đớt', 'Xã', 'Lâm Đớt', '107.350392', '16.112221', '3', '1507907', '579'], \
['Phường Trường An', 'Phường', 'Trường An', '107.583007', '16.445979', '3', '1573187', '323'], ['Xã Quảng Nhâm', 'Xã', 'Quảng Nhâm', '107.215865', '16.242336', '3', '1573443', '579'], \
['Phường Vĩ Dạ', 'Phường', 'Vĩ Dạ', '107.596057', '16.481971', '3', '1638723', '323'], ['Phường Vĩnh Ninh', 'Phường', 'Vĩnh Ninh', '107.589123', '16.45797', '3', '1704259', '323'], \
['Phường Xuân Phú', 'Phường', 'Xuân Phú', '107.601556', '16.462575', '3', '1769795', '323']]
TTH_ID_FROM_DB = 1
TTH_ID_FROM_FILE = '67'
EXISTING_DISTRICT = 'Quảng Điền'
EXISTING_DISTRICT_ID = 1231
EXISTING_DISTRICT_ID_IN_FILE = '2371'

def import_missing_communes_for_existing_district():
    for row in DATA_XA:
        if row[7] == EXISTING_DISTRICT_ID_IN_FILE:
            _, _ = Xa.objects.get_or_create(
                name = row[0],
                huyen_id = EXISTING_DISTRICT_ID,
                )

def import_missing_districts_and_communes():
    district_list = []
    district_ids = []
    commune_dict = {}
    
    # Get data of districts within Thua Thien Hue 

    for row in DATA_HUYEN:
        if row[7] == TTH_ID_FROM_FILE and row[6] != EXISTING_DISTRICT_ID_IN_FILE:
            district_list.append(row)
            district_ids.append(row[6])
    
    # Get data of communes within districts of Thua Thien Hue
    for row in DATA_XA:
        if row[7] in district_ids:
            current_dict = commune_dict.get(row[7], [])
            current_dict.append(row)
            commune_dict[row[7]] = current_dict
   
    # Import missing districts and communes 
    for district in district_list:
        huyen, created = Huyen.objects.get_or_create(
            name = district[0],
            tinh_id = TTH_ID_FROM_DB,
            )
        if created == True:
            for commune in commune_dict[district[6]]:
                _, _ = Xa.objects.get_or_create(
                    name = commune[0],
                    huyen_id = huyen.id,
                    )

if __name__ == '__main__':  
    import_missing_communes_for_existing_district()
    import_missing_districts_and_communes()


